//Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.
//0, 7, 8, -2, -2 -> 2
//1, -7, 567, 89, 223-> 3


Console.Write("Введите М чисел через запятую: ");
int[] arr = Array.ConvertAll(Console.ReadLine().Split(','), int.Parse); // Преобразует из одного типа в другой
int count = 0;
// Проверка чисел которые больше 0
for (int i = 0; i < arr.Length; i++)
{
    if (arr[i] > 0)
    {
        count++;
    }
}

Console.WriteLine($"Кол-во элементов больше 0:-> {count}");
